{
    "spots": [
        {
            "name": "Jaipur, Rajasthan",
            "lat": 26.9124,
            "lng": 75.7873,
            "weight": 0.95,
            "reason": "January offers pleasant, cool, and dry weather, ideal for exploring the city's magnificent forts, palaces, and vibrant markets. It's peak tourist season."
        },
        {
            "name": "Udaipur, Rajasthan",
            "lat": 24.5854,
            "lng": 73.7125,
            "weight": 0.95,
            "reason": "Known as the 'City of Lakes' and 'Venice of the East', Udaipur enjoys cool and comfortable weather in January, perfect for boat rides and visiting romantic palaces."
        },
        {
            "name": "Goa",
            "lat": 15.2993,
            "lng": 74.124,
            "weight": 0.9,
            "reason": "January provides ideal beach weather with clear skies and pleasant temperatures, perfect for relaxing on the beaches, water sports, and enjoying the vibrant nightlife."
        },
        {
            "name": "Alleppey (Alappuzha), Kerala",
            "lat": 9.4981,
            "lng": 76.3388,
            "weight": 0.95,
            "reason": "The backwaters of Kerala are at their most serene and beautiful in January. The cool, comfortable weather is perfect for houseboat cruises and exploring the lush landscape."
        },
        {
            "name": "Agra, Uttar Pradesh",
            "lat": 27.1767,
            "lng": 78.0078,
            "weight": 0.9,
            "reason": "Home to the iconic Taj Mahal, Agra in January has cool and crisp weather, excellent for sightseeing historical monuments. Mornings can be foggy but generally clear by midday."
        },
        {
            "name": "Varanasi, Uttar Pradesh",
            "lat": 25.3176,
            "lng": 82.9739,
            "weight": 0.9,
            "reason": "This ancient spiritual city on the Ganges offers cool and pleasant weather in January, making it ideal for exploring the ghats, temples, and experiencing its unique culture."
        },
        {
            "name": "Port Blair, Andaman & Nicobar Islands",
            "lat": 11.6234,
            "lng": 92.7265,
            "weight": 0.95,
            "reason": "January is considered the best time to visit with calm seas, clear skies, and perfect weather for island hopping, snorkeling, diving, and enjoying pristine beaches."
        },
        {
            "name": "Delhi",
            "lat": 28.7041,
            "lng": 77.1025,
            "weight": 0.85,
            "reason": "India's capital city experiences cool and crisp weather in January, making it excellent for exploring its historical sites, museums, and diverse culinary scene. Mornings can be chilly or foggy."
        }
    ]
}